///////////////////ДОМАШНЕЕ_ЗАДАНИЕ/////////////////////////////////////////////////////////////////
///////////////////STEP1////////////////////////////////////////////////////////////////////////////
/*
    Задача 1: Функция, возвращающая сумму двух чисел
    Напишите функцию, которая принимает два числа и возвращает их сумму.
*/


/*
    Задача 2: Вывод четных чисел

    Напишите программу, которая выводит на экран все четные числа от 1 до 10.


 */

/*
    Задача 3: Вычисление факториала

    Напишите программу, которая вычисляет факториал числа n.

*/


/*
    Задача 4: Использование блока let для создания новой области видимости

    Напишите программу, которая демонстрирует работу блока let для создания новой области видимости.
 */

///////////////////STEP2////////////////////////////////////////////////////////////////////////////

/*

    Задача 1
    Напишите функцию isPrime, которая принимает целое число и возвращает true,
    если число простое, и false, если число не является простым.
*/

/*

    Задача 2
    Напишите функцию getFibonacciSequence,
    которая принимает целое число n и возвращает первые n чисел в последовательности Фибоначчи.
 */

/*

    Задача 3
    Напишите функцию countWords, которая принимает строку и возвращает количество слов в строке.
 */

/*
    Задача 4
    Напишите функцию getMaxValue, которая принимает массив чисел и возвращает максимальное значение в массиве
 */

/*
    Задача 5
    Напишите функцию reverseString, которая принимает строку и возвращает перевернутую строку.
 */