///////////////////ДОМАШНЕЕ_ЗАДАНИЕ/////////////////////////////////////////////////////////////////

///////////////////STEP3////////////////////////////////////////////////////////////////////////////

/*
    Задача 1: Функция для подсчета суммы чисел
    Напишите функцию sum, которая принимает два числа и возвращает их сумму.
 */

/*
    Задача 2: Функция для проверки четности числа
    Напишите функцию isEven, которая принимает число и возвращает true,
    если число четное, и false, если число нечетное.
 */


/*
    Задача 3: Функция для поиска максимального числа в массиве
    Напишите функцию findMax, которая принимает массив чисел и возвращает максимальное число в этом массиве.
 */

/*
    Задача 4: Функция для фильтрации чисел
    Напишите функцию filterNumbers, которая принимает массив чисел и возвращает новый массив,
    содержащий только положительные числа.
 */