///////////////////ДОМАШНЕЕ_ЗАДАНИЕ/////////////////////////////////////////////////////////////////
///////////////////STEP4////////////////////////////////////////////////////////////////////////////


/*
    Задача 1
    Напишите функцию mergeArrays,
    которая принимает любое количество массивов в качестве аргументов и возвращает новый массив,
    содержащий все элементы из всех переданных массивов. Используйте оператор spread.
*/

/*
    Задача 2
    Напишите функцию filterNumbers, которая принимает любое количество аргументов и возвращает новый массив,
    содержащий только числа. Используйте оператор spread и метод filter().
 */

/*
    Задача 3
    Напишите функцию sumNumbers,
    которая принимает любое количество чисел в качестве аргументов и возвращает их сумму.
    Используйте оператор spread и метод reduce().
 */


/*
    Задача 4
    Напишите функцию sortNumbers,
    которая принимает любое количество чисел в качестве аргументов и возвращает новый массив,
    содержащий числа в отсортированном порядке по возрастанию.
    Используйте оператор spread и метод sort().
 */

/*
    Задача 5
    Напишите функцию cloneObject, которая принимает объект в качестве аргумента и возвращает его копию.
    Используйте оператор spread.
 */