///////////////////ДОМАШНЕЕ_ЗАДАНИЕ/////////////////////////////////////////////////////////////////
///////////////////STEP7////////////////////////////////////////////////////////////////////////////
/*
    Задача 1: Найти количество гласных в строке
    Напишите функцию, которая принимает строку и возвращает количество гласных в этой строке.
*/

/*
    Задача 2: Преобразовать строку в змеиную нотацию
    Напишите функцию, которая принимает строку и преобразует ее в змеиную нотацию (snake case).
    В змеиной нотации все слова разделяются символом подчеркивания _.
 */
///////////////////STEP8////////////////////////////////////////////////////////////////////////////

/*
   Задача 1. Создать класс "Person" с конструктором, принимающим параметры "name" и "age".
   Добавить метод "greet", который выводит в консоль приветственное сообщение с именем и возрастом человека.
   Создать объект "person" с именем "John" и возрастом 30, вызвать метод "greet".
*/

/*
    Задача 2. Создать класс "Animal" с конструктором, принимающим параметр "name". Добавить метод "speak",
     который выводит в консоль звук, издаваемый животным.
     Создать класс "Dog", который наследует класс "Animal" и добавляет метод "bark",
     который выводит в консоль звук лая собаки.
     Создать объект "dog" с именем "Rex", вызвать методы "speak" и "bark".
 */

/*

    Задача 3. Создать класс "Rectangle" с конструктором, принимающим параметры "width" и "height".
    Добавить методы "getArea" для получения площади прямоугольника
    и "getPerimeter" для получения периметра прямоугольника.
    Создать объект "rectangle" со сторонами 5 и 10, вызвать методы "getArea" и "getPerimeter".

 */


/*

    Задача 4. Создать класс "Point" с конструктором, принимающим параметры "x" и "y".
    Добавить методы "getX" и "getY" для получения координат точки.
    Создать класс "Line" с конструктором, принимающим параметры "point1" и "point2",
    которые являются объектами класса "Point". Добавить метод "getLength" для получения длины линии,
    проходящей через точки. Создать объекты "point1" с координатами (0, 0), "point2" с координатами (3, 4)
    и объект "line" с этими двумя точками, вызвать метод "getLength".

 */