///////////////////ДОМАШНЕЕ_ЗАДАНИЕ/////////////////////////////////////////////////////////////////
///////////////////STEP9////////////////////////////////////////////////////////////////////////////
/*
    Задача 1
    Создайте простой promise, который выполняет асинхронную операцию (просто задержку на 2 секунды).
    Затем используйте метод then для обработки успешного выполнения операции и метод catch для обработки ошибок.
*/

/*
    Задача 2
    https://jsonplaceholder.typicode.com
    Создайте два promises:
    первый для получения списка пользователей,
    а второй для получения постов пользователя по его ID.

    Затем используйте метод then для цепочки promises:
    после успешного выполнения первого promise получите ID первого пользователя из списка и передайте его
    второму promise для получения постов пользователя.
    Затем используйте метод then для вывода списка постов на экран и метод catch для обработки ошибок.
*/

/*
    Задача 3
    Создайте три promises для трех задач с разным временем выполнения.
    Затем используйте метод Promise.race для выполнения задачи с использованием наиболее быстрого из доступных методов:
    метод Promise.race принимает массив из нескольких promises и возвращает новый promise, который будет выполнен,
    когда любой из promises из массива будет выполнен.
    Затем используйте метод then для вывода результата на экран или метод catch для обработки ошибки.
 */
///////////////////STEP10////////////////////////////////////////////////////////////////////////////
/*
    Задача 1
    Напишите асинхронную функцию, которая принимает два числа и возвращает их сумму.
*/

/*
    Задача 2
    Напишите асинхронную функцию, которая принимает массив чисел и возвращает их сумму.
 */

/*
    Задача 3
    Напишите асинхронную функцию, которая принимает массив строк и возвращает их в обратном порядке.
 */

/*
     Задача 4
     Напишите асинхронную функцию, которая принимает два числа и возвращает их произведение с задержкой в одну секунду.
 */

/*
    Задача 5
    Напишите асинхронную функцию, которая принимает массив чисел и возвращает среднее значение с задержкой в две секунды.
 */